# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'heroku/brew' 

# Install CLI Tools
## Shell Utilities
brew 'zsh-completions'
brew 'tmux'
brew 'jq'
brew 'docker-compose'


## Network Utilities
brew 'wget'

## Dev Utilities
brew 'reattach-to-user-namespace'
brew 'git'
brew 'awscli'
brew 'nvm'
brew 'node'
brew 'vim'
brew 'pyenv'

# Mac Apps
cask '1password'
cask 'atext'
cask 'iterm2'
cask 'visual-studio-code'
cask 'slack'
cask 'docker'
cask 'rectangle'
cask 'karabiner-elements'
cask 'pastebot'
cask 'brave-browser'
cask 'google-chrome'
cask 'nvalt'
cask 'spotify'
cask 'tableplus'
cask 'via'
cask 'appcleaner'
cask 'gpg-suite'
cask 'postman'
cask 'sequel-pro'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-jetbrains-mono'

# App
mas 'XCode', id: 497799835